/* automatically generated by rust-bindgen 0.56.0 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::core::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::core::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::core::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::core::mem::transmute(self)
    }
}
impl<T> ::core::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::core::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::core::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::core::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::core::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::core::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::core::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::core::cmp::Eq for __BindgenUnionField<T> {}
pub const PICO_DEFAULT_UART: u32 = 0;
pub const PICO_DEFAULT_UART_TX_PIN: u32 = 0;
pub const PICO_DEFAULT_UART_RX_PIN: u32 = 1;
pub const PICO_DEFAULT_LED_PIN: u32 = 25;

pub const UART_UARTPCELLID0_UARTPCELLID0_ACCESS: &'static [u8; 3usize] = b"RO\0";
pub const UART_UARTPCELLID1_OFFSET: u32 = 4084;
pub const UART_UARTPCELLID1_BITS: u32 = 255;
pub const UART_UARTPCELLID1_RESET: u32 = 240;
pub const UART_UARTPCELLID1_UARTPCELLID1_RESET: u32 = 240;
pub const UART_UARTPCELLID1_UARTPCELLID1_BITS: u32 = 255;
pub const UART_UARTPCELLID1_UARTPCELLID1_MSB: u32 = 7;
pub const UART_UARTPCELLID1_UARTPCELLID1_LSB: u32 = 0;
pub const UART_UARTPCELLID1_UARTPCELLID1_ACCESS: &'static [u8; 3usize] = b"RO\0";
pub const UART_UARTPCELLID2_OFFSET: u32 = 4088;
pub const UART_UARTPCELLID2_BITS: u32 = 255;
pub const UART_UARTPCELLID2_RESET: u32 = 5;
pub const UART_UARTPCELLID2_UARTPCELLID2_RESET: u32 = 5;
pub const UART_UARTPCELLID2_UARTPCELLID2_BITS: u32 = 255;
pub const UART_UARTPCELLID2_UARTPCELLID2_MSB: u32 = 7;
pub const UART_UARTPCELLID2_UARTPCELLID2_LSB: u32 = 0;
pub const UART_UARTPCELLID2_UARTPCELLID2_ACCESS: &'static [u8; 3usize] = b"RO\0";
pub const UART_UARTPCELLID3_OFFSET: u32 = 4092;
pub const UART_UARTPCELLID3_BITS: u32 = 255;
pub const UART_UARTPCELLID3_RESET: u32 = 177;
pub const UART_UARTPCELLID3_UARTPCELLID3_RESET: u32 = 177;
pub const UART_UARTPCELLID3_UARTPCELLID3_BITS: u32 = 255;
pub const UART_UARTPCELLID3_UARTPCELLID3_MSB: u32 = 7;
pub const UART_UARTPCELLID3_UARTPCELLID3_LSB: u32 = 0;
pub const UART_UARTPCELLID3_UARTPCELLID3_ACCESS: &'static [u8; 3usize] = b"RO\0";
pub const PARAM_ASSERTIONS_ENABLED_UART: u32 = 0;
pub const PICO_UART_ENABLE_CRLF_SUPPORT: u32 = 1;
pub const PICO_UART_DEFAULT_CRLF: u32 = 0;
pub const PICO_DEFAULT_UART_BAUD_RATE: u32 = 115200;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = crate::ctypes::c_schar;
pub type __uint8_t = crate::ctypes::c_uchar;
pub type __int16_t = crate::ctypes::c_short;
pub type __uint16_t = crate::ctypes::c_ushort;
pub type __int32_t = crate::ctypes::c_int;
pub type __uint32_t = crate::ctypes::c_uint;
pub type __int64_t = crate::ctypes::c_longlong;
pub type __uint64_t = crate::ctypes::c_ulonglong;
pub type __darwin_intptr_t = crate::ctypes::c_long;
pub type __darwin_natural_t = crate::ctypes::c_uint;
pub type __darwin_ct_rune_t = crate::ctypes::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __mbstate_t {
    pub __mbstate8: __BindgenUnionField<[crate::ctypes::c_char; 128usize]>,
    pub _mbstateL: __BindgenUnionField<crate::ctypes::c_longlong>,
    pub bindgen_union_field: [u64; 16usize],
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__mbstate_t>())).__mbstate8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__mbstate_t>()))._mbstateL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = crate::ctypes::c_long;
pub type __darwin_size_t = crate::ctypes::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = crate::ctypes::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = crate::ctypes::c_int;
pub type __darwin_clock_t = crate::ctypes::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = crate::ctypes::c_long;
pub type __darwin_time_t = crate::ctypes::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = crate::ctypes::c_uint;
pub type __darwin_fsfilcnt_t = crate::ctypes::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [crate::ctypes::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [crate::ctypes::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut crate::ctypes::c_void)>,
    pub __arg: *mut crate::ctypes::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    assert_eq!(
        ::core::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::core::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__darwin_pthread_handler_rec>())).__routine as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__darwin_pthread_handler_rec>())).__arg as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__darwin_pthread_handler_rec>())).__next as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: crate::ctypes::c_long,
    pub __opaque: [crate::ctypes::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_opaque_pthread_attr_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_attr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: crate::ctypes::c_long,
    pub __opaque: [crate::ctypes::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_opaque_pthread_cond_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_cond_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: crate::ctypes::c_long,
    pub __opaque: [crate::ctypes::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_condattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_condattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: crate::ctypes::c_long,
    pub __opaque: [crate::ctypes::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_opaque_pthread_mutex_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_mutex_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: crate::ctypes::c_long,
    pub __opaque: [crate::ctypes::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_mutexattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_mutexattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: crate::ctypes::c_long,
    pub __opaque: [crate::ctypes::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_opaque_pthread_once_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_once_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: crate::ctypes::c_long,
    pub __opaque: [crate::ctypes::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_opaque_pthread_rwlock_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_rwlock_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: crate::ctypes::c_long,
    pub __opaque: [crate::ctypes::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_rwlockattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_rwlockattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: crate::ctypes::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [crate::ctypes::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_opaque_pthread_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_opaque_pthread_t>())).__cleanup_stack as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_opaque_pthread_t>())).__opaque as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = crate::ctypes::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_int8_t = crate::ctypes::c_uchar;
pub type u_int16_t = crate::ctypes::c_ushort;
pub type u_int32_t = crate::ctypes::c_uint;
pub type u_int64_t = crate::ctypes::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = crate::ctypes::c_long;
pub type uintmax_t = crate::ctypes::c_ulong;
pub type size_t = crate::ctypes::c_ulong;
pub type rsize_t = crate::ctypes::c_ulong;
pub type wchar_t = crate::ctypes::c_int;
pub type max_align_t = u128;
pub type uint = crate::ctypes::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct absolute_time_t {
    pub _private_us_since_boot: u64,
}
#[test]
fn bindgen_test_layout_absolute_time_t() {
    assert_eq!(
        ::core::mem::size_of::<absolute_time_t>(),
        8usize,
        concat!("Size of: ", stringify!(absolute_time_t))
    );
    assert_eq!(
        ::core::mem::align_of::<absolute_time_t>(),
        8usize,
        concat!("Alignment of ", stringify!(absolute_time_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<absolute_time_t>()))._private_us_since_boot as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(absolute_time_t),
            "::",
            stringify!(_private_us_since_boot)
        )
    );
}
#[doc = " \\struct datetime_t"]
#[doc = "  \\ingroup util_datetime"]
#[doc = "  \\brief Structure containing date and time information"]
#[doc = ""]
#[doc = "    When setting an RTC alarm, set a field to -1 tells"]
#[doc = "    the RTC to not match on this field"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct datetime_t {
    #[doc = "< 0..4095"]
    pub year: i16,
    #[doc = "< 1..12, 1 is January"]
    pub month: i8,
    #[doc = "< 1..28,29,30,31 depending on month"]
    pub day: i8,
    #[doc = "< 0..6, 0 is Sunday"]
    pub dotw: i8,
    #[doc = "< 0..23"]
    pub hour: i8,
    #[doc = "< 0..59"]
    pub min: i8,
    #[doc = "< 0..59"]
    pub sec: i8,
}
#[test]
fn bindgen_test_layout_datetime_t() {
    assert_eq!(
        ::core::mem::size_of::<datetime_t>(),
        8usize,
        concat!("Size of: ", stringify!(datetime_t))
    );
    assert_eq!(
        ::core::mem::align_of::<datetime_t>(),
        2usize,
        concat!("Alignment of ", stringify!(datetime_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<datetime_t>())).year as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(datetime_t),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<datetime_t>())).month as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(datetime_t),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<datetime_t>())).day as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(datetime_t),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<datetime_t>())).dotw as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(datetime_t),
            "::",
            stringify!(dotw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<datetime_t>())).hour as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(datetime_t),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<datetime_t>())).min as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(datetime_t),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<datetime_t>())).sec as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(datetime_t),
            "::",
            stringify!(sec)
        )
    );
}
extern "C" {
    pub fn panic_unsupported();
}
extern "C" {
    pub fn panic(fmt: *const crate::ctypes::c_char, ...);
}
extern "C" {
    pub fn running_on_fpga() -> bool;
}
extern "C" {
    pub fn rp2040_chip_version() -> u8;
}
extern "C" {
    pub fn __assert_rtn(
        arg1: *const crate::ctypes::c_char,
        arg2: *const crate::ctypes::c_char,
        arg3: crate::ctypes::c_int,
        arg4: *const crate::ctypes::c_char,
    );
}
pub const PICO_OK: crate::ctypes::c_int = 0;
pub const PICO_ERROR_NONE: crate::ctypes::c_int = 0;
pub const PICO_ERROR_TIMEOUT: crate::ctypes::c_int = -1;
pub const PICO_ERROR_GENERIC: crate::ctypes::c_int = -2;
pub const PICO_ERROR_NO_DATA: crate::ctypes::c_int = -3;
#[doc = " Common return codes from pico_sdk methods that return a status"]
pub type _bindgen_ty_1 = crate::ctypes::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stdio_driver {
    _unused: [u8; 0],
}
pub type stdio_driver_t = stdio_driver;
extern "C" {
    #[doc = " \\brief Initialize all of the present standard stdio types that are linked into the binary."]
    #[doc = " \\ingroup pico_stdio"]
    #[doc = ""]
    #[doc = " Call this method once you have set up your clocks to enable the stdio support for UART, USB"]
    #[doc = " and semihosting based on the presence of the respective librariess in the binary."]
    #[doc = ""]
    #[doc = " \\see stdio_uart, stdio_usb, stdio_semihosting"]
    pub fn stdio_init_all();
}
extern "C" {
    #[doc = " \\brief Initialize all of the present standard stdio types that are linked into the binary."]
    #[doc = " \\ingroup pico_stdio"]
    #[doc = ""]
    #[doc = " Call this method once you have set up your clocks to enable the stdio support for UART, USB"]
    #[doc = " and semihosting based on the presence of the respective librariess in the binary."]
    #[doc = ""]
    #[doc = " \\see stdio_uart, stdio_usb, stdio_semihosting"]
    pub fn stdio_flush();
}
extern "C" {
    #[doc = " \\brief Return a character from stdin if there is one available within a timeout"]
    #[doc = " \\ingroup pico_stdio"]
    #[doc = ""]
    #[doc = " \\param timeout_us the timeout in microseconds, or 0 to not wait for a character if none available."]
    #[doc = " \\return the character from 0-255 or PICO_ERROR_TIMEOUT if timeout occurs"]
    pub fn getchar_timeout_us(timeout_us: u32) -> crate::ctypes::c_int;
}
extern "C" {
    #[doc = " \\brief Adds or removes a driver from the list of active drivers used for input/output"]
    #[doc = " \\ingroup pico_stdio"]
    #[doc = ""]
    #[doc = " \\note this method should always be called on an initialized driver"]
    #[doc = " \\param driver the driver"]
    #[doc = " \\param enabled true to add, false to remove"]
    pub fn stdio_set_driver_enabled(driver: *mut stdio_driver_t, enabled: bool);
}
extern "C" {
    #[doc = " \\brief Control limiting of output to a single driver"]
    #[doc = " \\ingroup pico_stdio"]
    #[doc = ""]
    #[doc = " \\note this method should always be called on an initialized driver"]
    #[doc = ""]
    #[doc = " \\param driver if non-null then output only that driver will be used for input/output (assuming it is in the list of enabled drivers)."]
    #[doc = "               if NULL then all enabled drivers will be used"]
    pub fn stdio_filter_driver(driver: *mut stdio_driver_t);
}
extern "C" {
    #[doc = " \\brief control conversion of line feeds to carriage return on transmissions"]
    #[doc = " \\ingroup pico_stdio"]
    #[doc = ""]
    #[doc = " \\note this method should always be called on an initialized driver"]
    #[doc = ""]
    #[doc = " \\param driver the driver"]
    #[doc = " \\param translate If true, convert line feeds to carriage return on transmissions"]
    pub fn stdio_set_translate_crlf(driver: *mut stdio_driver_t, translate: bool);
}
pub type io_rw_32 = u32;
pub type io_ro_32 = u32;
pub type io_wo_32 = u32;
pub type io_rw_16 = u16;
pub type io_ro_16 = u16;
pub type io_wo_16 = u16;
pub type io_rw_8 = u8;
pub type io_ro_8 = u8;
pub type io_wo_8 = u8;
pub type ioptr = *mut u8;
pub type const_ioptr = ioptr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timer_hw_t {
    pub timehw: io_wo_32,
    pub timelw: io_wo_32,
    pub timehr: io_ro_32,
    pub timelr: io_ro_32,
    pub alarm: [io_rw_32; 4usize],
    pub armed: io_rw_32,
    pub timerawh: io_ro_32,
    pub timerawl: io_ro_32,
    pub dbgpause: io_rw_32,
    pub pause: io_rw_32,
    pub intr: io_rw_32,
    pub inte: io_rw_32,
    pub intf: io_rw_32,
    pub ints: io_ro_32,
}
#[test]
fn bindgen_test_layout_timer_hw_t() {
    assert_eq!(
        ::core::mem::size_of::<timer_hw_t>(),
        68usize,
        concat!("Size of: ", stringify!(timer_hw_t))
    );
    assert_eq!(
        ::core::mem::align_of::<timer_hw_t>(),
        4usize,
        concat!("Alignment of ", stringify!(timer_hw_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).timehw as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(timehw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).timelw as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(timelw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).timehr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(timehr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).timelr as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(timelr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).alarm as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(alarm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).armed as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(armed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).timerawh as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(timerawh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).timerawl as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(timerawl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).dbgpause as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(dbgpause)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).pause as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(pause)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).intr as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(intr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).inte as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(inte)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).intf as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(intf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timer_hw_t>())).ints as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(timer_hw_t),
            "::",
            stringify!(ints)
        )
    );
}
extern "C" {
    #[doc = " \\brief Return the current 64 bit timestamp value in microseconds"]
    #[doc = "  \\ingroup hardware_timer"]
    #[doc = ""]
    #[doc = " Returns the full 64 bits of the hardware timer. The \\ref pico_time and other functions rely on the fact that this"]
    #[doc = " value monotonically increases from power up. As such it is expected that this value counts upwards and never wraps"]
    #[doc = " (we apologize for introducing a potential year 5851444 bug)."]
    #[doc = ""]
    #[doc = " \\return the 64 bit timestamp"]
    pub fn time_us_64() -> u64;
}
extern "C" {
    #[doc = " \\brief Busy wait wasting cycles for the given (32 bit) number of microseconds"]
    #[doc = "  \\ingroup hardware_timer"]
    #[doc = ""]
    #[doc = " \\param delay_us delay amount"]
    pub fn busy_wait_us_32(delay_us: u32);
}
extern "C" {
    #[doc = " \\brief Busy wait wasting cycles for the given (64 bit) number of microseconds"]
    #[doc = "  \\ingroup hardware_timer"]
    #[doc = ""]
    #[doc = " \\param delay_us delay amount"]
    pub fn busy_wait_us(delay_us: u64);
}
extern "C" {
    #[doc = " \\brief Busy wait wasting cycles until after the specified timestamp"]
    #[doc = "  \\ingroup hardware_timer"]
    #[doc = ""]
    #[doc = " \\param t Absolute time to wait until"]
    pub fn busy_wait_until(t: absolute_time_t);
}
#[doc = " Callback function type for hardware alarms"]
#[doc = "  \\ingroup hardware_timer"]
#[doc = ""]
#[doc = " \\param alarm_num the hardware alarm number"]
#[doc = " \\sa hardware_alarm_set_callback"]
pub type hardware_alarm_callback_t = ::core::option::Option<unsafe extern "C" fn(alarm_num: uint)>;
extern "C" {
    #[doc = " \\brief cooperatively claim the use of this hardware alarm_num"]
    #[doc = "  \\ingroup hardware_timer"]
    #[doc = ""]
    #[doc = " This method hard asserts if the hardware alarm is currently claimed."]
    #[doc = ""]
    #[doc = " \\param alarm_num the hardware alarm to claim"]
    #[doc = " \\sa hardware_claiming"]
    pub fn hardware_alarm_claim(alarm_num: uint);
}
extern "C" {
    #[doc = " \\brief cooperatively release the claim on use of this hardware alarm_num"]
    #[doc = "  \\ingroup hardware_timer"]
    #[doc = ""]
    #[doc = " \\param alarm_num the hardware alarm to unclaim"]
    #[doc = " \\sa hardware_claiming"]
    pub fn hardware_alarm_unclaim(alarm_num: uint);
}
extern "C" {
    #[doc = " \\brief Enable/Disable a callback for a hardware timer on this core"]
    #[doc = "  \\ingroup hardware_timer"]
    #[doc = ""]
    #[doc = " This method enables/disables the alarm IRQ for the specified hardware alarm on the"]
    #[doc = " calling core, and set the specified callback to be associated with that alarm."]
    #[doc = ""]
    #[doc = " This callback will be used for the timeout set via hardware_alarm_set_target"]
    #[doc = ""]
    #[doc = " \\note This will install the handler on the current core if the IRQ handler isn't already set."]
    #[doc = " Therefore the user has the opportunity to call this up from the core of their choice"]
    #[doc = ""]
    #[doc = " \\param alarm_num the hardware alarm number"]
    #[doc = " \\param callback the callback to install, or NULL to unset"]
    #[doc = ""]
    #[doc = " \\sa hardware_alarm_set_target"]
    pub fn hardware_alarm_set_callback(alarm_num: uint, callback: hardware_alarm_callback_t);
}
extern "C" {
    #[doc = " \\brief Set the current target for the specified hardware alarm"]
    #[doc = ""]
    #[doc = " This will replace any existing target"]
    #[doc = ""]
    #[doc = " @param alarm_num the hardware alarm number"]
    #[doc = " @param t the target timestamp"]
    #[doc = " @return true if the target was \"missed\"; i.e. it was in the past, or occurred before a future hardware timeout could be set"]
    pub fn hardware_alarm_set_target(alarm_num: uint, t: absolute_time_t) -> bool;
}
extern "C" {
    #[doc = " \\brief Cancel an existing target (if any) for a given hardware_alarm"]
    #[doc = ""]
    #[doc = " @param alarm_num"]
    pub fn hardware_alarm_cancel(alarm_num: uint);
}
extern "C" {
    pub static at_the_end_of_time: absolute_time_t;
}
extern "C" {
    pub static nil_time: absolute_time_t;
}
extern "C" {
    #[doc = " \\brief Wait until after the given timestamp to return"]
    #[doc = " \\ingroup sleep"]
    #[doc = ""]
    #[doc = " \\note  This method attempts to perform a lower power (WFE) sleep"]
    #[doc = ""]
    #[doc = " \\param target the time after which to return"]
    #[doc = " \\sa sleep_us()"]
    #[doc = " \\sa busy_wait_until()"]
    pub fn sleep_until(target: absolute_time_t);
}
extern "C" {
    #[doc = " \\brief Wait for the given number of microseconds before returning"]
    #[doc = " \\ingroup sleep"]
    #[doc = ""]
    #[doc = " \\note This method attempts to perform a lower power (WFE) sleep"]
    #[doc = ""]
    #[doc = " \\param us the number of microseconds to sleep"]
    #[doc = " \\sa busy_wait_us()"]
    pub fn sleep_us(us: u64);
}
extern "C" {
    #[doc = " \\brief Wait for the given number of milliseconds before returning"]
    #[doc = " \\ingroup sleep"]
    #[doc = ""]
    #[doc = " \\note This method attempts to perform a lower power sleep (using WFE) as much as possible."]
    #[doc = ""]
    #[doc = " \\param ms the number of milliseconds to sleep"]
    pub fn sleep_ms(ms: u32);
}
extern "C" {
    #[doc = " \\brief Helper method for blocking on a timeout"]
    #[doc = " \\ingroup sleep"]
    #[doc = ""]
    #[doc = " This method will return in response to a an event (as per __wfe) or"]
    #[doc = " when the target time is reached, or at any point before."]
    #[doc = ""]
    #[doc = " This method can be used to implement a lower power polling loop waiting on"]
    #[doc = " some condition signalled by an event (__sev())."]
    #[doc = ""]
    #[doc = " This is called \\a best_effort because under certain circumstances (notably the default timer pool"]
    #[doc = " being disabled or full) the best effort is simply to return immediately without a __wfe, thus turning the calling"]
    #[doc = " code into a busy wait."]
    #[doc = ""]
    #[doc = " Example usage:"]
    #[doc = " ```c"]
    #[doc = " bool my_function_with_timeout_us(uint64_t timeout_us) {"]
    #[doc = "     absolute_time_t timeout_time = make_timeout_time_us(timeout_us);"]
    #[doc = "     do {"]
    #[doc = "         // each time round the loop, we check to see if the condition"]
    #[doc = "         // we are waiting on has happened"]
    #[doc = "         if (my_check_done()) {"]
    #[doc = "             // do something"]
    #[doc = "             return true;"]
    #[doc = "         }"]
    #[doc = "         // will try to sleep until timeout or the next processor event"]
    #[doc = "     } while (!best_effort_wfe_or_timeout(timeout_time));"]
    #[doc = "     return false; // timed out"]
    #[doc = " }"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " @param timeout_timestamp the timeout time"]
    #[doc = " @return true if the target time is reached, false otherwise"]
    pub fn best_effort_wfe_or_timeout(timeout_timestamp: absolute_time_t) -> bool;
}
#[doc = " \\brief The identifier for an alarm"]
#[doc = ""]
#[doc = " \\note this identifier is signed because -1 is used as an error condition when creating alarms"]
#[doc = ""]
#[doc = " \\note alarm ids may be reused, however for convenience the implementation makes an attempt to defer"]
#[doc = " reusing as long as possible. You should certainly expect it to be hundreds of ids before one is"]
#[doc = " reused, although in most cases it is more. Nonetheless care must still be taken when cancelling"]
#[doc = " alarms or other functionality based on alarms when the alarm may have expired, as eventually"]
#[doc = " the alarm id may be reused for another alarm."]
#[doc = ""]
#[doc = " \\ingroup alarm"]
pub type alarm_id_t = i32;
#[doc = " \\brief User alarm callback"]
#[doc = " \\ingroup alarm"]
#[doc = " \\param id the alarm_id as returned when the alarm was added"]
#[doc = " \\param user_data the user data passed when the alarm was added"]
#[doc = " \\return <0 to reschedule the same alarm this many us from the time the alarm was previously scheduled to fire"]
#[doc = " \\return >0 to reschedule the same alarm this many us from the time this method returns"]
#[doc = " \\return 0 to not reschedule the alarm"]
pub type alarm_callback_t = ::core::option::Option<
    unsafe extern "C" fn(id: alarm_id_t, user_data: *mut crate::ctypes::c_void) -> i64,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct alarm_pool {
    _unused: [u8; 0],
}
pub type alarm_pool_t = alarm_pool;
extern "C" {
    #[doc = " \\brief Create the default alarm pool (if not already created or disabled)"]
    #[doc = " \\ingroup alarm"]
    pub fn alarm_pool_init_default();
}
extern "C" {
    #[doc = " \\brief The default alarm pool used when alarms are added without specifying an alarm pool,"]
    #[doc = "        and also used by the Pico SDK to support lower power sleeps and timeouts."]
    #[doc = ""]
    #[doc = " \\ingroup alarm"]
    #[doc = " \\sa #PICO_TIME_DEFAULT_ALARM_POOL_HARDWARE_ALARM_NUM"]
    pub fn alarm_pool_get_default() -> *mut alarm_pool_t;
}
extern "C" {
    #[doc = " \\brief Create an alarm pool"]
    #[doc = ""]
    #[doc = " The alarm pool will call callbacks from an alarm IRQ Handler on the core of this function is called from."]
    #[doc = ""]
    #[doc = " In many situations there is never any need for anything other than the default alarm pool, however you"]
    #[doc = " might want to create another if you want alarm callbacks on core 1 or require alarm pools of"]
    #[doc = " different priority (IRQ priority based preemption of callbacks)"]
    #[doc = ""]
    #[doc = " \\note This method will hard assert if the hardware alarm is already claimed."]
    #[doc = ""]
    #[doc = " \\ingroup alarm"]
    #[doc = " \\param hardware_alarm_num the hardware alarm to use to back this pool"]
    #[doc = " \\param max_timers the maximum number of timers"]
    #[doc = "        \\note For implementation reasons this is limited to PICO_PHEAP_MAX_ENTRIES which defaults to 255"]
    #[doc = " \\sa alarm_pool_get_default()"]
    #[doc = " \\sa hardware_claiming"]
    pub fn alarm_pool_create(hardware_alarm_num: uint, max_timers: uint) -> *mut alarm_pool_t;
}
extern "C" {
    #[doc = " \\brief Return the hardware alarm used by an alarm pool"]
    #[doc = " \\ingroup alarm"]
    #[doc = " \\param pool the pool"]
    #[doc = " \\return the hardware alarm used by the pool"]
    pub fn alarm_pool_hardware_alarm_num(pool: *mut alarm_pool_t) -> uint;
}
extern "C" {
    #[doc = " \\brief Destroy the alarm pool, cancelling all alarms and freeing up the underlying hardware alarm"]
    #[doc = " \\ingroup alarm"]
    #[doc = " \\param pool the pool"]
    #[doc = " \\return the hardware alarm used by the pool"]
    pub fn alarm_pool_destroy(pool: *mut alarm_pool_t);
}
extern "C" {
    #[doc = " \\brief Add an alarm callback to be called at a specific time"]
    #[doc = " \\ingroup alarm"]
    #[doc = ""]
    #[doc = " Generally the callback is called as soon as possible after the time specified from an IRQ handler"]
    #[doc = " on the core the alarm pool was created on. If the callback is in the past or happens before"]
    #[doc = " the alarm setup could be completed, then this method will optionally call the callback itself"]
    #[doc = " and then return a return code to indicate that the target time has passed."]
    #[doc = ""]
    #[doc = " \\note It is safe to call this method from an IRQ handler (including alarm callbacks), and from either core."]
    #[doc = ""]
    #[doc = " @param pool the alarm pool to use for scheduling the callback (this determines which hardware alarm is used, and which core calls the callback)"]
    #[doc = " @param time the timestamp when (after which) the callback should fire"]
    #[doc = " @param callback the callback function"]
    #[doc = " @param user_data user data to pass to the callback function"]
    #[doc = " @param fire_if_past if true, this method will call the callback itself before returning 0 if the timestamp happens before or during this method call"]
    #[doc = " @return >0 the alarm id"]
    #[doc = " @return 0 the target timestamp was during or before this method call (whether the callback was called depends on fire_if_past)"]
    #[doc = " @return -1 if there were no alarm slots available"]
    pub fn alarm_pool_add_alarm_at(
        pool: *mut alarm_pool_t,
        time: absolute_time_t,
        callback: alarm_callback_t,
        user_data: *mut crate::ctypes::c_void,
        fire_if_past: bool,
    ) -> alarm_id_t;
}
extern "C" {
    #[doc = " \\brief Cancel an alarm"]
    #[doc = " \\ingroup alarm"]
    #[doc = " \\param pool the alarm_pool containing the alarm"]
    #[doc = " \\param alarm_id the alarm"]
    #[doc = " \\return true if the alarm was cancelled, false if it didn't exist"]
    #[doc = " \\sa alarm_id_t for a note on reuse of IDs"]
    pub fn alarm_pool_cancel_alarm(pool: *mut alarm_pool_t, alarm_id: alarm_id_t) -> bool;
}
#[doc = " \\defgroup repeating_timer repeating_timer"]
#[doc = " \\ingroup pico_time"]
#[doc = " \\brief Repeating Timer functions for simple scheduling of repeated execution"]
#[doc = ""]
#[doc = " \\note The regular \\a alarm_ functionality can be used to make repeating alarms (by return non zero from the callback),"]
#[doc = " however these methods abstract that further (at the cost of a user structure to store the repeat delay in (which"]
#[doc = " the alarm framework does not have space for)."]
pub type repeating_timer_t = repeating_timer;
#[doc = " \\brief Callback for a repeating timer"]
#[doc = " \\ingroup repeating_timer"]
#[doc = " \\param rt repeating time structure containing information about the repeating time. user_data is of primary important to the user"]
#[doc = " \\return true to continue repeating, false to stop."]
pub type repeating_timer_callback_t =
    ::core::option::Option<unsafe extern "C" fn(rt: *mut repeating_timer_t) -> bool>;
#[doc = " \\brief Information about a repeating timer"]
#[doc = " \\ingroup repeating_timer"]
#[doc = " \\return"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct repeating_timer {
    pub delay_us: i64,
    pub pool: *mut alarm_pool_t,
    pub alarm_id: alarm_id_t,
    pub callback: repeating_timer_callback_t,
    pub user_data: *mut crate::ctypes::c_void,
}
#[test]
fn bindgen_test_layout_repeating_timer() {
    assert_eq!(
        ::core::mem::size_of::<repeating_timer>(),
        40usize,
        concat!("Size of: ", stringify!(repeating_timer))
    );
    assert_eq!(
        ::core::mem::align_of::<repeating_timer>(),
        8usize,
        concat!("Alignment of ", stringify!(repeating_timer))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<repeating_timer>())).delay_us as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(repeating_timer),
            "::",
            stringify!(delay_us)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<repeating_timer>())).pool as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(repeating_timer),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<repeating_timer>())).alarm_id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(repeating_timer),
            "::",
            stringify!(alarm_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<repeating_timer>())).callback as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(repeating_timer),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<repeating_timer>())).user_data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(repeating_timer),
            "::",
            stringify!(user_data)
        )
    );
}
extern "C" {
    #[doc = " \\brief Add a repeating timer that is called repeatedly at the specified interval in microseconds"]
    #[doc = " \\ingroup repeating_timer"]
    #[doc = ""]
    #[doc = " Generally the callback is called as soon as possible after the time specified from an IRQ handler"]
    #[doc = " on the core the alarm pool was created on. If the callback is in the past or happens before"]
    #[doc = " the alarm setup could be completed, then this method will optionally call the callback itself"]
    #[doc = " and then return a return code to indicate that the target time has passed."]
    #[doc = ""]
    #[doc = " \\note It is safe to call this method from an IRQ handler (including alarm callbacks), and from either core."]
    #[doc = ""]
    #[doc = " @param pool the alarm pool to use for scheduling the repeating timer (this determines which hardware alarm is used, and which core calls the callback)"]
    #[doc = " @param delay_us the repeat delay in microseconds; if >0 then this is the delay between one callback ending and the next starting; if <0 then this is the negative of the time between the starts of the callbacks. The value of 0 is treated as 1"]
    #[doc = " @param callback the repeating timer callback function"]
    #[doc = " @param user_data user data to pass to store in the repeating_timer structure for use by the callback."]
    #[doc = " @param out the pointer to the user owned structure to store the repeating timer info in. BEWARE this storage location must outlive the repeating timer, so be careful of using stack space"]
    #[doc = " @return false if there were no alarm slots available to create the timer, true otherwise."]
    pub fn alarm_pool_add_repeating_timer_us(
        pool: *mut alarm_pool_t,
        delay_us: i64,
        callback: repeating_timer_callback_t,
        user_data: *mut crate::ctypes::c_void,
        out: *mut repeating_timer_t,
    ) -> bool;
}
extern "C" {
    #[doc = " \\brief Cancel a repeating timer"]
    #[doc = " \\ingroup repeating_timer"]
    #[doc = " \\param timer the repeating timer to cancel"]
    #[doc = " \\return true if the repeating timer was cancelled, false if it didn't exist"]
    #[doc = " \\sa alarm_id_t for a note on reuse of IDs"]
    pub fn cancel_repeating_timer(timer: *mut repeating_timer_t) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct interp_hw_t {
    pub accum: [io_rw_32; 2usize],
    pub base: [io_rw_32; 3usize],
    pub pop: [io_ro_32; 3usize],
    pub peek: [io_ro_32; 3usize],
    pub ctrl: [io_rw_32; 2usize],
    pub add_raw: [io_rw_32; 2usize],
    pub base01: io_wo_32,
}
#[test]
fn bindgen_test_layout_interp_hw_t() {
    assert_eq!(
        ::core::mem::size_of::<interp_hw_t>(),
        64usize,
        concat!("Size of: ", stringify!(interp_hw_t))
    );
    assert_eq!(
        ::core::mem::align_of::<interp_hw_t>(),
        4usize,
        concat!("Alignment of ", stringify!(interp_hw_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<interp_hw_t>())).accum as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(interp_hw_t),
            "::",
            stringify!(accum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<interp_hw_t>())).base as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(interp_hw_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<interp_hw_t>())).pop as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(interp_hw_t),
            "::",
            stringify!(pop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<interp_hw_t>())).peek as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(interp_hw_t),
            "::",
            stringify!(peek)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<interp_hw_t>())).ctrl as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(interp_hw_t),
            "::",
            stringify!(ctrl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<interp_hw_t>())).add_raw as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(interp_hw_t),
            "::",
            stringify!(add_raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<interp_hw_t>())).base01 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(interp_hw_t),
            "::",
            stringify!(base01)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sio_hw_t {
    pub cpuid: io_ro_32,
    pub gpio_in: io_ro_32,
    pub gpio_hi_in: io_ro_32,
    pub _pad: u32,
    pub gpio_out: io_wo_32,
    pub gpio_set: io_wo_32,
    pub gpio_clr: io_wo_32,
    pub gpio_togl: io_wo_32,
    pub gpio_oe: io_wo_32,
    pub gpio_oe_set: io_wo_32,
    pub gpio_oe_clr: io_wo_32,
    pub gpio_oe_togl: io_wo_32,
    pub gpio_hi_out: io_wo_32,
    pub gpio_hi_set: io_wo_32,
    pub gpio_hi_clr: io_wo_32,
    pub gpio_hi_togl: io_wo_32,
    pub gpio_hi_oe: io_wo_32,
    pub gpio_hi_oe_set: io_wo_32,
    pub gpio_hi_oe_clr: io_wo_32,
    pub gpio_hi_oe_togl: io_wo_32,
    pub fifo_st: io_rw_32,
    pub fifo_wr: io_wo_32,
    pub fifo_rd: io_ro_32,
    pub spinlock_st: io_ro_32,
    pub div_udividend: io_rw_32,
    pub div_udivisor: io_rw_32,
    pub div_sdividend: io_rw_32,
    pub div_sdivisor: io_rw_32,
    pub div_quotient: io_rw_32,
    pub div_remainder: io_rw_32,
    pub div_csr: io_rw_32,
    pub _pad2: u32,
    pub interp: [interp_hw_t; 2usize],
}
#[test]
fn bindgen_test_layout_sio_hw_t() {
    assert_eq!(
        ::core::mem::size_of::<sio_hw_t>(),
        256usize,
        concat!("Size of: ", stringify!(sio_hw_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sio_hw_t>(),
        4usize,
        concat!("Alignment of ", stringify!(sio_hw_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).cpuid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(cpuid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_in as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_in)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_in as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_in)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>()))._pad as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(_pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_out as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_set as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_clr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_clr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_togl as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_togl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_oe as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_oe)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_oe_set as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_oe_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_oe_clr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_oe_clr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_oe_togl as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_oe_togl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_out as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_set as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_clr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_clr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_togl as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_togl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_oe as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_oe)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_oe_set as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_oe_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_oe_clr as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_oe_clr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).gpio_hi_oe_togl as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(gpio_hi_oe_togl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).fifo_st as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(fifo_st)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).fifo_wr as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(fifo_wr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).fifo_rd as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(fifo_rd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).spinlock_st as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(spinlock_st)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).div_udividend as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(div_udividend)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).div_udivisor as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(div_udivisor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).div_sdividend as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(div_sdividend)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).div_sdivisor as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(div_sdivisor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).div_quotient as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(div_quotient)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).div_remainder as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(div_remainder)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).div_csr as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(div_csr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>()))._pad2 as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(_pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sio_hw_t>())).interp as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(sio_hw_t),
            "::",
            stringify!(interp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct padsbank0_hw_t {
    pub voltage_select: io_rw_32,
    pub io: [io_rw_32; 30usize],
}
#[test]
fn bindgen_test_layout_padsbank0_hw_t() {
    assert_eq!(
        ::core::mem::size_of::<padsbank0_hw_t>(),
        124usize,
        concat!("Size of: ", stringify!(padsbank0_hw_t))
    );
    assert_eq!(
        ::core::mem::align_of::<padsbank0_hw_t>(),
        4usize,
        concat!("Alignment of ", stringify!(padsbank0_hw_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<padsbank0_hw_t>())).voltage_select as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(padsbank0_hw_t),
            "::",
            stringify!(voltage_select)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<padsbank0_hw_t>())).io as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(padsbank0_hw_t),
            "::",
            stringify!(io)
        )
    );
}
pub const gpio_function_GPIO_FUNC_XIP: gpio_function = 0;
pub const gpio_function_GPIO_FUNC_SPI: gpio_function = 1;
pub const gpio_function_GPIO_FUNC_UART: gpio_function = 2;
pub const gpio_function_GPIO_FUNC_I2C: gpio_function = 3;
pub const gpio_function_GPIO_FUNC_PWM: gpio_function = 4;
pub const gpio_function_GPIO_FUNC_SIO: gpio_function = 5;
pub const gpio_function_GPIO_FUNC_PIO0: gpio_function = 6;
pub const gpio_function_GPIO_FUNC_PIO1: gpio_function = 7;
pub const gpio_function_GPIO_FUNC_GPCK: gpio_function = 8;
pub const gpio_function_GPIO_FUNC_USB: gpio_function = 9;
pub const gpio_function_GPIO_FUNC_NULL: gpio_function = 15;
#[doc = " \\brief  GPIO function definitions for use with function select"]
#[doc = "  \\ingroup hardware_gpio"]
#[doc = " \\brief GPIO function selectors"]
#[doc = ""]
#[doc = " Each GPIO can have one function selected at a time. Likewise, each peripheral input (e.g. UART0 RX) should only be"]
#[doc = " selected on one GPIO at a time. If the same peripheral input is connected to multiple GPIOs, the peripheral sees the logical"]
#[doc = " OR of these GPIO inputs."]
#[doc = ""]
#[doc = " Please refer to the datsheet for more information on GPIO function selection."]
pub type gpio_function = crate::ctypes::c_uint;
pub const gpio_irq_level_GPIO_IRQ_LEVEL_LOW: gpio_irq_level = 1;
pub const gpio_irq_level_GPIO_IRQ_LEVEL_HIGH: gpio_irq_level = 2;
pub const gpio_irq_level_GPIO_IRQ_EDGE_FALL: gpio_irq_level = 4;
pub const gpio_irq_level_GPIO_IRQ_EDGE_RISE: gpio_irq_level = 8;
#[doc = " \\brief  GPIO Interrupt level definitions"]
#[doc = "  \\ingroup hardware_gpio"]
#[doc = "  \\brief GPIO Interrupt levels"]
#[doc = ""]
#[doc = " An interrupt can be generated for every GPIO pin in 4 scenarios:"]
#[doc = ""]
#[doc = " * Level High: the GPIO pin is a logical 1"]
#[doc = " * Level Low: the GPIO pin is a logical 0"]
#[doc = " * Edge High: the GPIO has transitioned from a logical 0 to a logical 1"]
#[doc = " * Edge Low: the GPIO has transitioned from a logical 1 to a logical 0"]
#[doc = ""]
#[doc = " The level interrupts are not latched. This means that if the pin is a logical 1 and the level high interrupt is active, it will"]
#[doc = " become inactive as soon as the pin changes to a logical 0. The edge interrupts are stored in the INTR register and can be"]
#[doc = " cleared by writing to the INTR register."]
pub type gpio_irq_level = crate::ctypes::c_uint;
pub type gpio_irq_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gpio: uint, events: u32)>;
#[doc = "< peripheral signal selected via \\ref gpio_set_function"]
pub const gpio_override_GPIO_OVERRIDE_NORMAL: gpio_override = 0;
#[doc = "< invert peripheral signal selected via \\ref gpio_set_function"]
pub const gpio_override_GPIO_OVERRIDE_INVERT: gpio_override = 1;
#[doc = "< drive low/disable output"]
pub const gpio_override_GPIO_OVERRIDE_LOW: gpio_override = 2;
#[doc = "< drive high/enable output"]
pub const gpio_override_GPIO_OVERRIDE_HIGH: gpio_override = 3;
pub type gpio_override = crate::ctypes::c_uint;
extern "C" {
    #[doc = " \\brief Select GPIO function"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param fn Which GPIO function select to use from list \\ref gpio_function"]
    pub fn gpio_set_function(gpio: uint, fn_: gpio_function);
}
extern "C" {
    pub fn gpio_get_function(gpio: uint) -> gpio_function;
}
extern "C" {
    #[doc = " \\brief Select up and down pulls on specific GPIO"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param up If true set a pull up on the GPIO"]
    #[doc = " \\param down If true set a pull down on the GPIO"]
    #[doc = ""]
    #[doc = " \\note On the RP2040, setting both pulls enables a \"bus keep\" function,"]
    #[doc = " i.e. a weak pull to whatever is current high/low state of GPIO."]
    pub fn gpio_set_pulls(gpio: uint, up: bool, down: bool);
}
extern "C" {
    #[doc = " \\brief Set GPIO output override"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param value See \\ref gpio_override"]
    pub fn gpio_set_outover(gpio: uint, value: uint);
}
extern "C" {
    #[doc = " \\brief Select GPIO input override"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param value See \\ref gpio_override"]
    pub fn gpio_set_inover(gpio: uint, value: uint);
}
extern "C" {
    #[doc = " \\brief Select GPIO output enable override"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param value See \\ref gpio_override"]
    pub fn gpio_set_oeover(gpio: uint, value: uint);
}
extern "C" {
    #[doc = " \\brief Enable GPIO input"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param enabled true to enable input on specified GPIO"]
    pub fn gpio_set_input_enabled(gpio: uint, enabled: bool);
}
extern "C" {
    #[doc = " \\brief Enable or disable interrupts for specified GPIO"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\note The IO IRQs are independent per-processor. This configures IRQs for"]
    #[doc = " the processor that calls the function."]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param events Which events will cause an interrupt"]
    #[doc = " \\param enabled Enable or disable flag"]
    #[doc = ""]
    #[doc = " Events is a bitmask of the following:"]
    #[doc = ""]
    #[doc = " bit | interrupt"]
    #[doc = " ----|----------"]
    #[doc = "   0 | Low level"]
    #[doc = "   1 | High level"]
    #[doc = "   2 | Edge low"]
    #[doc = "   3 | Edge high"]
    pub fn gpio_set_irq_enabled(gpio: uint, events: u32, enabled: bool);
}
extern "C" {
    #[doc = " \\brief Enable interrupts for specified GPIO"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\note The IO IRQs are independent per-processor. This configures IRQs for"]
    #[doc = " the processor that calls the function."]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param events Which events will cause an interrupt See \\ref gpio_set_irq_enabled for details."]
    #[doc = " \\param enabled Enable or disable flag"]
    #[doc = " \\param callback user function to call on GPIO irq. Note only one of these can be set per processor."]
    #[doc = ""]
    #[doc = " \\note Currently the GPIO parameter is ignored, and this callback will be called for any enabled GPIO IRQ on any pin."]
    #[doc = ""]
    pub fn gpio_set_irq_enabled_with_callback(
        gpio: uint,
        events: u32,
        enabled: bool,
        callback: gpio_irq_callback_t,
    );
}
extern "C" {
    #[doc = " \\brief Enable dormant wake up interrupt for specified GPIO"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " This configures IRQs to restart the XOSC or ROSC when they are"]
    #[doc = " disabled in dormant mode"]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param events Which events will cause an interrupt. See \\ref gpio_set_irq_enabled for details."]
    #[doc = " \\param enabled Enable/disable flag"]
    pub fn gpio_set_dormant_irq_enabled(gpio: uint, events: u32, enabled: bool);
}
extern "C" {
    #[doc = " \\brief Acknowledge a GPIO interrupt"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    #[doc = " \\param events Bitmask of events to clear. See \\ref gpio_set_irq_enabled for details."]
    #[doc = ""]
    pub fn gpio_acknowledge_irq(gpio: uint, events: u32);
}
extern "C" {
    #[doc = " \\brief Initialise a GPIO for (enabled I/O and set func to GPIO_FUNC_SIO)"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " Clear the output enable (i.e. set to input)"]
    #[doc = " Clear any output value."]
    #[doc = ""]
    #[doc = " \\param gpio GPIO number"]
    pub fn gpio_init(gpio: uint);
}
extern "C" {
    #[doc = " \\brief Initialise multiple GPIOs (enabled I/O and set func to GPIO_FUNC_SIO)"]
    #[doc = "  \\ingroup hardware_gpio"]
    #[doc = ""]
    #[doc = " Clear the output enable (i.e. set to input)"]
    #[doc = " Clear any output value."]
    #[doc = ""]
    #[doc = " \\param gpio_mask Mask with 1 bit per GPIO number to initialize"]
    pub fn gpio_init_mask(gpio_mask: uint);
}
extern "C" {
    pub fn gpio_debug_pins_init();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uart_hw_t {
    pub dr: io_rw_32,
    pub rsr: io_rw_32,
    pub _pad0: [u32; 4usize],
    pub fr: io_rw_32,
    pub _pad1: u32,
    pub ilpr: io_rw_32,
    pub ibrd: io_rw_32,
    pub fbrd: io_rw_32,
    pub lcr_h: io_rw_32,
    pub cr: io_rw_32,
    pub ifls: io_rw_32,
    pub imsc: io_rw_32,
    pub ris: io_rw_32,
    pub mis: io_rw_32,
    pub icr: io_rw_32,
    pub dmacr: io_rw_32,
}
#[test]
fn bindgen_test_layout_uart_hw_t() {
    assert_eq!(
        ::core::mem::size_of::<uart_hw_t>(),
        76usize,
        concat!("Size of: ", stringify!(uart_hw_t))
    );
    assert_eq!(
        ::core::mem::align_of::<uart_hw_t>(),
        4usize,
        concat!("Alignment of ", stringify!(uart_hw_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).dr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(dr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).rsr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(rsr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>()))._pad0 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).fr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(fr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>()))._pad1 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).ilpr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(ilpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).ibrd as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(ibrd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).fbrd as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(fbrd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).lcr_h as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(lcr_h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).cr as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(cr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).ifls as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(ifls)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).imsc as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(imsc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).ris as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(ris)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).mis as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(mis)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).icr as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(icr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<uart_hw_t>())).dmacr as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(uart_hw_t),
            "::",
            stringify!(dmacr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uart_inst {
    _unused: [u8; 0],
}
#[doc = " \\file hardware/uart.h"]
#[doc = "  \\defgroup hardware_uart hardware_uart"]
#[doc = ""]
#[doc = " Hardware UART API"]
#[doc = ""]
#[doc = " RP2040 has 2 identical instances of a UART peripheral, based on the ARM PL011. Each UART can be connected to a number"]
#[doc = " of GPIO pins as defined in the GPIO muxing."]
#[doc = ""]
#[doc = " Only the TX, RX, RTS, and CTS signals are"]
#[doc = " connected, meaning that the modem mode and IrDA mode of the PL011 are not supported."]
#[doc = ""]
#[doc = " \\subsection uart_example Example"]
#[doc = " \\addtogroup hardware_uart"]
#[doc = ""]
#[doc = "  \\code"]
#[doc = "  int main() {"]
#[doc = ""]
#[doc = "     // Initialise UART 0"]
#[doc = "     uart_init(uart0, 115200);"]
#[doc = ""]
#[doc = "     // Set the GPIO pin mux to the UART - 0 is TX, 1 is RX"]
#[doc = "     gpio_set_function(0, GPIO_FUNC_UART);"]
#[doc = "     gpio_set_function(1, GPIO_FUNC_UART);"]
#[doc = ""]
#[doc = "     uart_puts(uart0, \"Hello world!\");"]
#[doc = " }"]
#[doc = " \\endcode"]
pub type uart_inst_t = uart_inst;
pub const uart_parity_t_UART_PARITY_NONE: uart_parity_t = 0;
pub const uart_parity_t_UART_PARITY_EVEN: uart_parity_t = 1;
pub const uart_parity_t_UART_PARITY_ODD: uart_parity_t = 2;
#[doc = " \\brief UART Parity enumeration"]
#[doc = "  \\ingroup hardware_uart"]
pub type uart_parity_t = crate::ctypes::c_uint;
extern "C" {
    #[doc = " \\brief Initialise a UART"]
    #[doc = "  \\ingroup hardware_uart"]
    #[doc = ""]
    #[doc = " Put the UART into a known state, and enable it. Must be called before other"]
    #[doc = " functions."]
    #[doc = ""]
    #[doc = " \\note There is no guarantee that the baudrate requested will be possible, the nearest will be chosen,"]
    #[doc = " and this function will return the configured baud rate."]
    #[doc = ""]
    #[doc = " \\param uart UART instance. \\ref uart0 or \\ref uart1"]
    #[doc = " \\param baudrate Baudrate of UART in Hz"]
    #[doc = " \\return Actual set baudrate"]
    pub fn uart_init(uart: *mut uart_inst_t, baudrate: uint) -> uint;
}
extern "C" {
    #[doc = " \\brief DeInitialise a UART"]
    #[doc = "  \\ingroup hardware_uart"]
    #[doc = ""]
    #[doc = " Disable the UART if it is no longer used. Must be reinitialised before"]
    #[doc = " being used again."]
    #[doc = ""]
    #[doc = " \\param uart UART instance. \\ref uart0 or \\ref uart1"]
    pub fn uart_deinit(uart: *mut uart_inst_t);
}
extern "C" {
    #[doc = " \\brief Set UART baud rate"]
    #[doc = "  \\ingroup hardware_uart"]
    #[doc = ""]
    #[doc = " Set baud rate as close as possible to requested, and return actual rate selected."]
    #[doc = ""]
    #[doc = " \\param uart UART instance. \\ref uart0 or \\ref uart1"]
    #[doc = " \\param baudrate Baudrate in Hz"]
    pub fn uart_set_baudrate(uart: *mut uart_inst_t, baudrate: uint) -> uint;
}
extern "C" {
    #[doc = " \\brief Set CR/LF conversion on UART"]
    #[doc = "  \\ingroup hardware_uart"]
    #[doc = ""]
    #[doc = " \\param uart UART instance. \\ref uart0 or \\ref uart1"]
    #[doc = " \\param translate If true, convert line feeds to carriage return on transmissions"]
    pub fn uart_set_translate_crlf(uart: *mut uart_inst_t, translate: bool);
}
extern "C" {
    #[doc = " \\brief Wait for up to a certain number of microseconds for the RX FIFO to be non empty"]
    #[doc = "  \\ingroup hardware_uart"]
    #[doc = ""]
    #[doc = " \\param uart UART instance. \\ref uart0 or \\ref uart1"]
    #[doc = " \\param us the number of microseconds to wait at most (may be 0 for an instantaneous check)"]
    #[doc = " \\return true if the RX FIFO became non empty before the timeout, false otherwise"]
    pub fn uart_is_readable_within_us(uart: *mut uart_inst_t, us: u32) -> bool;
}
extern "C" {
    #[doc = " \\brief Set up the default UART and assign it to the default GPIO's"]
    #[doc = "  \\ingroup pico_stdlib"]
    #[doc = ""]
    #[doc = " By default this will use UART 0, with TX to pin GPIO 0,"]
    #[doc = " RX to pin GPIO 1, and the baudrate to 115200"]
    #[doc = ""]
    #[doc = " Calling this method also initializes stdin/stdout over UART if the"]
    #[doc = " @ref pico_stdio_uart library is linked."]
    #[doc = ""]
    #[doc = " Defaults can be changed using configuration defines,"]
    #[doc = "  PICO_DEFAULT_UART_INSTANCE,"]
    #[doc = "  PICO_DEFAULT_UART_BAUD_RATE"]
    #[doc = "  PICO_DEFAULT_UART_TX_PIN"]
    #[doc = "  PICO_DEFAULT_UART_RX_PIN"]
    pub fn setup_default_uart();
}
extern "C" {
    #[doc = " \\brief Initialise the system clock to 48MHz"]
    #[doc = "  \\ingroup pico_stdlib"]
    #[doc = ""]
    #[doc = "  Set the system clock to 48MHz, and set the peripheral clock to match."]
    pub fn set_sys_clock_48mhz();
}
extern "C" {
    #[doc = " \\brief Initialise the system clock"]
    #[doc = "  \\ingroup pico_stdlib"]
    #[doc = ""]
    #[doc = " \\param vco_freq The voltage controller oscillator frequency to be used by the SYS PLL"]
    #[doc = " \\param post_div1 The first post divider for the SYS PLL"]
    #[doc = " \\param post_div2 The second post divider for the SYS PLL."]
    #[doc = ""]
    #[doc = " See the PLL documentation in the datasheet for details of driving the PLLs."]
    pub fn set_sys_clock_pll(vco_freq: u32, post_div1: uint, post_div2: uint);
}
extern "C" {
    #[doc = " \\brief Check if a given system clock frequency is valid/attainable"]
    #[doc = "  \\ingroup pico_stdlib"]
    #[doc = ""]
    #[doc = " \\param freq_khz Requested frequency"]
    #[doc = " \\param vco_freq_out On success, the voltage controller oscillator frequeucny to be used by the SYS PLL"]
    #[doc = " \\param post_div1_out On success, The first post divider for the SYS PLL"]
    #[doc = " \\param post_div2_out On success, The second post divider for the SYS PLL."]
    #[doc = " @return true if the frequency is possible and the output parameters have been written."]
    pub fn check_sys_clock_khz(
        freq_khz: u32,
        vco_freq_out: *mut uint,
        post_div1_out: *mut uint,
        post_div2_out: *mut uint,
    ) -> bool;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: crate::ctypes::c_uint,
    pub fp_offset: crate::ctypes::c_uint,
    pub overflow_arg_area: *mut crate::ctypes::c_void,
    pub reg_save_area: *mut crate::ctypes::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    assert_eq!(
        ::core::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::core::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__va_list_tag>())).gp_offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(gp_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__va_list_tag>())).fp_offset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(fp_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__va_list_tag>())).overflow_arg_area as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(overflow_arg_area)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__va_list_tag>())).reg_save_area as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(reg_save_area)
        )
    );
}
